In [9]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [10]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string

connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
data1 = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
data1.head()

data2 = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14,1632,416,2005-06-18,2,2006-02-15
1,1159,2005-06-14,4395,516,2005-06-17,1,2006-02-15
2,1160,2005-06-14,2795,239,2005-06-18,2,2006-02-15
3,1161,2005-06-14,1690,285,2005-06-21,1,2006-02-15
4,1162,2005-06-14,987,310,2005-06-23,1,2006-02-15

In [11]:
engine.execute("USE sakila")

In [12]:
query = "SELECT customer_id, count(customer_id) from rentals_may group by customer_id order by customer_id, rental_id;"

data1 = pd.read_sql_query(query, engine)
data1.head()

   customer_id  count(customer_id)
0            1                   2
1            2                   1
2            3                   2
3            5                   3
4            6                   3

In [13]:
query = "SELECT customer_id, count(customer_id) from rentals_june group by customer_id order by customer_id, rental_id;"

data2 = pd.read_sql_query(query, engine)
data2.head()

   customer_id  count(customer_id)
0            1                   7
1            2                   1
2            3                   4
3            4                   6
4            5                   5

In [19]:
data3=pd.DataFrame.merge(data1, data2, how='inner', on='customer_id')

In [20]:
data3.head()

   customer_id  count(customer_id)_x  count(customer_id)_y
0            1                     2                     7
1            2                     1                     1
2            3                     2                     4
3            5                     3                     5
4            6                     3                     4

In [26]:
def rental(x,y):
    if x > y:
        return('client lent more books in may')
    elif y > x:
        return('client lent more books in june')
    else:
        return('same number')

In [30]:
data3['difference']=list(map(rental, data3['count(customer_id)_x'], data3['count(customer_id)_y']))

In [34]:
#data3[['count(customer_id)_x','count(customer_id)_y']].apply(rental)

In [31]:
data3.head()

,customer_id,count(customer_id)_x,count(customer_id)_y,difference
0,1,2,7,client lent more books in june
1,2,1,1,same number
2,3,2,4,client lent more books in june
3,5,3,5,client lent more books in june
4,6,3,4,client lent more books in june